{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"node": [{"name": "accuracy_calc/predictions/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Output_Layer/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Output_Layer/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Hidden_Layer_2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Hidden_Layer_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Hidden_Layer_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Hidden_Layer_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Hidden_Layer_1/MatMul", "op": "MatMul", "input": ["X", "Hidden_Layer_1/weights"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Hidden_Layer_1/add", "op": "Add", "input": ["Hidden_Layer_1/MatMul", "Hidden_Layer_1/biases"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Hidden_Layer_1/Relu", "op": "Relu", "input": ["Hidden_Layer_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Hidden_Layer_2/MatMul", "op": "MatMul", "input": ["Hidden_Layer_1/Relu", "Hidden_Layer_2/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Hidden_Layer_2/add", "op": "Add", "input": ["Hidden_Layer_2/MatMul", "Hidden_Layer_2/biases"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Hidden_Layer_2/Relu", "op": "Relu", "input": ["Hidden_Layer_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Output_Layer/MatMul", "op": "MatMul", "input": ["Hidden_Layer_2/Relu", "Output_Layer/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Output_Layer/add", "op": "Add", "input": ["Output_Layer/MatMul", "Output_Layer/biases"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Output_Layer/Softmax", "op": "Softmax", "input": ["Output_Layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/predictions", "op": "ArgMax", "input": ["Output_Layer/Softmax", "accuracy_calc/predictions/dimension"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "output_type": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "accuracy_calc/predictions/dimension", "shape": [], "dtype": "int32"}, {"name": "Output_Layer/biases", "shape": [10], "dtype": "float32"}, {"name": "Output_Layer/weights", "shape": [64, 10], "dtype": "float32"}, {"name": "Hidden_Layer_2/biases", "shape": [64], "dtype": "float32"}, {"name": "Hidden_Layer_2/weights", "shape": [512, 64], "dtype": "float32"}, {"name": "Hidden_Layer_1/biases", "shape": [512], "dtype": "float32"}, {"name": "Hidden_Layer_1/weights", "shape": [784, 512], "dtype": "float32"}]}]}